src/cf/src/Catalogs/ПользовательскиеИстории/ПользовательскиеИстории.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПользовательскиеИстории</name>
  <owners>Catalog.ИсторииТребования</owners>
  <attributes>
    <name>Релиз</name>
    <type>
      <types>CatalogRef.ВерсииКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеИстории</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Роль</name>
    <type>
      <types>CatalogRef.ИсторииРоль</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформационнаяСистема</name>
    <type>
      <types>CatalogRef.ИнформационныеСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>Пометка</name>
    <type>
      <types>EnumRef.ЦветаЗаметок</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Catalogs/ПользовательскиеИстории/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РольПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ОписаниеИстории) Тогда
		Возврат;	
	КонецЕсли;
	
	ОбновитьПользовательскуюИсторию();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполненаПриИзменении(Элемент)
	
	Объект.ДатаВыполнения = ?(Объект.Выполнена, ОбщегоНазначенияКлиент.ДатаСеанса(), '00010101');
	
КонецПроцедуры

&НаСервере
Процедура ВладелецПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		Объект.Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "Владелец.Проект");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	ВладелецПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьИсторию(Команда)
	
	ОбновитьПользовательскуюИсторию();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьПользовательскуюИсторию()

	Если Не ЗначениеЗаполнено(Объект.Роль) Тогда
		Возврат;		
	КонецЕсли;
	
	СтрокаОбработки = НСтр("ru = 'Как %1 хочу %2, чтобы (цель)'");
	Объект.ОписаниеИстории = СтрШаблон(СтрокаОбработки, Объект.Роль, Объект.Наименование);

КонецПроцедуры 

#КонецОбласти
